#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
module.web_server.aws_security_group.default: Refreshing state... [id=sg-01f4f76e0610554c3]
aws_s3_bucket.records: Refreshing state... [id=mmdev-test-records]
aws_vpc.example: Refreshing state... [id=vpc-056119713e08dd6f0]
aws_s3_bucket.alb_log: Refreshing state... [id=mmdev-test-alb-log]
aws_s3_bucket.frontend: Refreshing state... [id=mmdev-test-frontend]
module.web_server.aws_instance.default: Refreshing state... [id=i-0a812e35d2fa205e4]
aws_subnet.private_1: Refreshing state... [id=subnet-073ef9a8c35ec43c0]
module.http_redirect_sg.aws_security_group.default: Refreshing state... [id=sg-0e82126dfda24ebc9]
aws_internet_gateway.example: Refreshing state... [id=igw-0bea8ed4f3e2c7f3f]
module.https_sg.aws_security_group.default: Refreshing state... [id=sg-0ee589928c50608a4]
aws_route_table.private_0: Refreshing state... [id=rtb-051852fe680a78177]
aws_route_table.private_1: Refreshing state... [id=rtb-0e376e566b0bfd079]
aws_route_table.public: Refreshing state... [id=rtb-0ccee54b195c71376]
aws_subnet.public_1: Refreshing state... [id=subnet-0d32a52e2808dafb3]
aws_subnet.public_0: Refreshing state... [id=subnet-0a41403ae5d308e70]
aws_subnet.private_0: Refreshing state... [id=subnet-09c6c3c2cc6909a17]
module.http_sg.aws_security_group.default: Refreshing state... [id=sg-0a7dbd18c6285ca9f]
aws_eip.nat_gateway_1: Refreshing state... [id=eipalloc-068bfbcc8ee13f582]
aws_eip.nat_gateway_0: Refreshing state... [id=eipalloc-0135ef28406752525]
module.https_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-1703109790]
module.https_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-838302217]
aws_route_table_association.private_1: Refreshing state... [id=rtbassoc-03d8150914ecdec73]
module.http_redirect_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-2051229157]
module.http_redirect_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-672509324]
aws_route.public: Refreshing state... [id=r-rtb-0ccee54b195c713761080289494]
aws_route_table_association.public_1: Refreshing state... [id=rtbassoc-059ef70d0699d1053]
module.http_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-951650053]
module.http_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-3658532139]
aws_route_table_association.public_0: Refreshing state... [id=rtbassoc-0f5ddf96bd18400c9]
aws_route_table_association.private_0: Refreshing state... [id=rtbassoc-0dbae5e3cb32c202a]
aws_nat_gateway.example_1: Refreshing state... [id=nat-0a66cc6930195e01a]
aws_nat_gateway.example_0: Refreshing state... [id=nat-0f3f206dbffce7621]
aws_route.private_1: Refreshing state... [id=r-rtb-0e376e566b0bfd0791080289494]
aws_route.private_0: Refreshing state... [id=r-rtb-051852fe680a781771080289494]
aws_lb.example: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:138767642386:loadbalancer/app/example/d4a4744b5c5232a5]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_eip.nat_gateway_0 has changed
  ~ resource "aws_eip" "nat_gateway_0" {
      + association_id       = "eipassoc-045c9b95ff63ccce7"
        id                   = "eipalloc-0135ef28406752525"
      + network_interface    = "eni-0ba72904e2d67f76e"
      + private_dns          = "ip-10-0-1-199.ap-northeast-1.compute.internal"
      + private_ip           = "10.0.1.199"
      + tags                 = {}
        # (8 unchanged attributes hidden)
    }

  # aws_eip.nat_gateway_1 has changed
  ~ resource "aws_eip" "nat_gateway_1" {
      + association_id       = "eipassoc-0e23b1085e6262ce8"
        id                   = "eipalloc-068bfbcc8ee13f582"
      + network_interface    = "eni-09d44ec422cb9344c"
      + private_dns          = "ip-10-0-2-203.ap-northeast-1.compute.internal"
      + private_ip           = "10.0.2.203"
      + tags                 = {}
        # (8 unchanged attributes hidden)
    }

  # aws_internet_gateway.example has changed
  ~ resource "aws_internet_gateway" "example" {
        id       = "igw-0bea8ed4f3e2c7f3f"
      + tags     = {}
        # (4 unchanged attributes hidden)
    }

  # aws_lb.example has changed
  ~ resource "aws_lb" "example" {
      + arn                        = "arn:aws:elasticloadbalancing:ap-northeast-1:138767642386:loadbalancer/app/example/d4a4744b5c5232a5"
      + arn_suffix                 = "app/example/d4a4744b5c5232a5"
      + dns_name                   = "example-67416631.ap-northeast-1.elb.amazonaws.com"
      ~ enable_deletion_protection = true -> false
        id                         = "arn:aws:elasticloadbalancing:ap-northeast-1:138767642386:loadbalancer/app/example/d4a4744b5c5232a5"
      + ip_address_type            = "ipv4"
        name                       = "example"
      + tags                       = {}
      + tags_all                   = {}
      + vpc_id                     = "vpc-056119713e08dd6f0"
      + zone_id                    = "Z14GRHDCWA56QT"
        # (9 unchanged attributes hidden)

      ~ access_logs {
          - bucket  = "mmdev-test-alb-log" -> null
          ~ enabled = true -> false
        }

      + subnet_mapping {
          + subnet_id = "subnet-0a41403ae5d308e70"
        }
      + subnet_mapping {
          + subnet_id = "subnet-0d32a52e2808dafb3"
        }
    }

  # aws_nat_gateway.example_0 has changed
  ~ resource "aws_nat_gateway" "example_0" {
        id                   = "nat-0f3f206dbffce7621"
      + tags                 = {}
        # (7 unchanged attributes hidden)
    }

  # aws_nat_gateway.example_1 has changed
  ~ resource "aws_nat_gateway" "example_1" {
        id                   = "nat-0a66cc6930195e01a"
      + tags                 = {}
        # (7 unchanged attributes hidden)
    }

  # aws_route_table.private_0 has changed
  ~ resource "aws_route_table" "private_0" {
        id               = "rtb-051852fe680a78177"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0f3f206dbffce7621"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {}
        # (5 unchanged attributes hidden)
    }

  # aws_route_table.private_1 has changed
  ~ resource "aws_route_table" "private_1" {
        id               = "rtb-0e376e566b0bfd079"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0a66cc6930195e01a"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {}
        # (5 unchanged attributes hidden)
    }

  # aws_route_table.public has changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0ccee54b195c71376"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0bea8ed4f3e2c7f3f"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {}
        # (5 unchanged attributes hidden)
    }

  # aws_s3_bucket.alb_log has changed
  ~ resource "aws_s3_bucket" "alb_log" {
        id                          = "mmdev-test-alb-log"
      + tags                        = {}
        # (10 unchanged attributes hidden)

      ~ lifecycle_rule {
            id                                     = "tf-s3-lifecycle-20220209082123223900000002"
          + tags                                   = {}
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.frontend has changed
  ~ resource "aws_s3_bucket" "frontend" {
        id                          = "mmdev-test-frontend"
      + tags                        = {}
        # (10 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket.records has changed
  ~ resource "aws_s3_bucket" "records" {
        id                          = "mmdev-test-records"
      + tags                        = {}
        # (10 unchanged attributes hidden)

      ~ lifecycle_rule {
            id                                     = "tf-s3-lifecycle-20220209082123220600000001"
          + tags                                   = {}
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }


        # (2 unchanged blocks hidden)
    }

  # aws_subnet.private_0 has changed
  ~ resource "aws_subnet" "private_0" {
        id                                             = "subnet-09c6c3c2cc6909a17"
      + tags                                           = {}
        # (15 unchanged attributes hidden)
    }

  # aws_subnet.private_1 has changed
  ~ resource "aws_subnet" "private_1" {
        id                                             = "subnet-073ef9a8c35ec43c0"
      + tags                                           = {}
        # (15 unchanged attributes hidden)
    }

  # aws_subnet.public_0 has changed
  ~ resource "aws_subnet" "public_0" {
        id                                             = "subnet-0a41403ae5d308e70"
      + tags                                           = {}
        # (15 unchanged attributes hidden)
    }

  # aws_subnet.public_1 has changed
  ~ resource "aws_subnet" "public_1" {
        id                                             = "subnet-0d32a52e2808dafb3"
      + tags                                           = {}
        # (15 unchanged attributes hidden)
    }

  # module.http_redirect_sg.aws_security_group.default has changed
  ~ resource "aws_security_group" "default" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0e82126dfda24ebc9"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
        name                   = "http-redirect-sg"
      + tags                   = {}
        # (6 unchanged attributes hidden)
    }

  # module.http_redirect_sg.aws_security_group_rule.egress has changed
  ~ resource "aws_security_group_rule" "egress" {
        id                = "sgrule-2051229157"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (7 unchanged attributes hidden)
    }

  # module.http_redirect_sg.aws_security_group_rule.ingress has changed
  ~ resource "aws_security_group_rule" "ingress" {
        id                = "sgrule-672509324"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (7 unchanged attributes hidden)
    }

  # module.http_sg.aws_security_group.default has changed
  ~ resource "aws_security_group" "default" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0a7dbd18c6285ca9f"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
        name                   = "http-sg"
      + tags                   = {}
        # (6 unchanged attributes hidden)
    }

  # module.http_sg.aws_security_group_rule.egress has changed
  ~ resource "aws_security_group_rule" "egress" {
        id                = "sgrule-951650053"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (7 unchanged attributes hidden)
    }

  # module.http_sg.aws_security_group_rule.ingress has changed
  ~ resource "aws_security_group_rule" "ingress" {
        id                = "sgrule-3658532139"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (7 unchanged attributes hidden)
    }

  # module.https_sg.aws_security_group.default has changed
  ~ resource "aws_security_group" "default" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0ee589928c50608a4"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
        name                   = "https-sg"
      + tags                   = {}
        # (6 unchanged attributes hidden)
    }

  # module.https_sg.aws_security_group_rule.egress has changed
  ~ resource "aws_security_group_rule" "egress" {
        id                = "sgrule-1703109790"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (7 unchanged attributes hidden)
    }

  # module.https_sg.aws_security_group_rule.ingress has changed
  ~ resource "aws_security_group_rule" "ingress" {
        id                = "sgrule-838302217"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (7 unchanged attributes hidden)
    }

  # module.web_server.aws_instance.default has changed
  ~ resource "aws_instance" "default" {
        id                                   = "i-0a812e35d2fa205e4"
      + tags                                 = {}
        # (29 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # module.web_server.aws_security_group.default has changed
  ~ resource "aws_security_group" "default" {
        id                     = "sg-01f4f76e0610554c3"
        name                   = "ec2"
      + tags                   = {}
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lb.example is tainted, so must be replaced
-/+ resource "aws_lb" "example" {
      ~ arn                        = "arn:aws:elasticloadbalancing:ap-northeast-1:138767642386:loadbalancer/app/example/d4a4744b5c5232a5" -> (known after apply)
      ~ arn_suffix                 = "app/example/d4a4744b5c5232a5" -> (known after apply)
      ~ dns_name                   = "example-67416631.ap-northeast-1.elb.amazonaws.com" -> (known after apply)
      ~ enable_deletion_protection = false -> true
      ~ id                         = "arn:aws:elasticloadbalancing:ap-northeast-1:138767642386:loadbalancer/app/example/d4a4744b5c5232a5" -> (known after apply)
      ~ ip_address_type            = "ipv4" -> (known after apply)
        name                       = "example"
      - tags                       = {} -> null
      ~ tags_all                   = {} -> (known after apply)
      ~ vpc_id                     = "vpc-056119713e08dd6f0" -> (known after apply)
      ~ zone_id                    = "Z14GRHDCWA56QT" -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ access_logs {
          + bucket  = "mmdev-test-alb-log"
          ~ enabled = false -> true
        }

      - subnet_mapping {
          - subnet_id = "subnet-0a41403ae5d308e70" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0d32a52e2808dafb3" -> null
        }
      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "これはHTTPです"
              + status_code  = "200"
            }
        }
    }

  # aws_s3_bucket_policy.alb_log will be created
  + resource "aws_s3_bucket_policy" "alb_log" {
      + bucket = "mmdev-test-alb-log"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:PutObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "138767642386"
                        }
                      + Resource  = "arn:aws:s3:::mmdev-test-alb-log/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

Plan: 3 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + alb_dns_name = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @mmdev110, Action: `pull_request`*